# <p align="center"> Министерство образования Республики Беларусь </p>

## <p align="center"> Учреждение образования «Брестский государственный технический университет»</p>

### <p align="center"> Кафедра ИИТ</p>



#### <p align="center">Лабораторная работа №1</p>

#### <p align="center">Modeling controlled object (Моделирование управляемого объекта)</p>

<p align="right" >Выполнил: </p>

<p align="right" >Студент 3 курса</p>

<p align="right" >Группы АС-55</p>

<p align="right" >Марзан А.В.</p>

<p align="right" >Проверил:</p>

<p align="right" >Иванюк Д.С.</p>

#### <p align="center">Брест, 2021</p>

<p align="center">Цель работы: Написать программу, которая имитирует температуру данного объекта.</p>

<p align="center">Ход работы </p>

Код программы :
```
    #include <iostream>
    #include <cmath>
    using namespace std;

    int main() 
    {
    int t = 7;
    double a = 0.1, b = 0.02, c = 0.003, d = 0.0004;
    double y0 = 22;
    double y1, y2, y22;
    double ut = 2, utt = 1;

    cout << "Input an initial temperature of some object: ";
    cin >> y1; y2 = y1;
    cout << "Simulation of this object's temperature...\n";

    cout << "T\tLinear model\tNonlinear model\n";
    cout << 0 << "\t\t" << y1 << "\t\t" << y2 << "\n";
    y1 = a * y1 + b * ut;
    y22 = y1;
    cout << 1 << "\t\t" << y1 << "\t\t" << y22 << "\n";

    for (int i = 1; i <= t; i++) {
        y1 = a * y1 + b * ut;
        y2 = a * y2 - b * pow(y22, 2) + c * ut + d * sin(utt);
        cout << i << "\t\t" << y1 << "\t\t" << y2 << "\n";
    }
    return 0;
}
```
